РасчетныеЗадачиЗанятие5/src/Documents/БольничныйЛист/БольничныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БольничныйЛист</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСРаботниками</registerRecords>
  <registerRecords>CalculationRegister.ОсновныеНачисления</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыплаты</name>
    <type>
      <types>EnumRef.ПроцентыВыплатыБольничного</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ПоложительноеЧисло</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВидыГрафиковРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>DefinedType.ДенежнаяСумма</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>DefinedType.КоличествоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>Сторно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РасчетныеЗадачиЗанятие5/src/InformationRegisters/СостояниеСотрудников/СостояниеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеСотрудников</name>
  <comment>Сведения о сотрудниках</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРаботы</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияФизическогоЛица</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РасчетныеЗадачиЗанятие5/src/Enums/ПроцентыВыплатыБольничного/ПроцентыВыплатыБольничного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПроцентыВыплатыБольничного</name>
  <enumValues>
    <name>_60</name>
  </enumValues>
  <enumValues>
    <name>_80</name>
  </enumValues>
  <enumValues>
    <name>_100</name>
  </enumValues>
</mdclass:Enum>

РасчетныеЗадачиЗанятие5/src/Documents/БольничныйЛист/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	
	Объект.ПериодРегистрации = НачалоМесяца(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	ФизическоеЛицоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФизическоеЛицоПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиСрезПоследних.ФизическоеЛицо,
	|	СотрудникиСрезПоследних.Подразделение,
	|	СотрудникиСрезПоследних.Должность,
	|	СотрудникиСрезПоследних.ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(СотрудникиСрезПоследних.Период, &Дата, ГОД) < 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПроцентыВыплатыБольничного._60)
	|		КОГДА РАЗНОСТЬДАТ(СотрудникиСрезПоследних.Период, &Дата, ГОД) >= 3
	|				И РАЗНОСТЬДАТ(СотрудникиСрезПоследних.Период, &Дата, ГОД) < 6
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПроцентыВыплатыБольничного._80)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПроцентыВыплатыБольничного._100)
	|	КОНЕЦ КАК ПроцентВыплаты
	|ИЗ
	|	РегистрСведений.СостояниеСотрудников.СрезПоследних(&Дата, ФизическоеЛицо = &ФизическоеЛицо) КАК СотрудникиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ФизическоеЛицо", Объект.ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Объект.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
		Объект.Должность = ВыборкаДетальныеЗаписи.Должность;
		Объект.ГрафикРаботы = ВыборкаДетальныеЗаписи.ГрафикРаботы;
		Объект.ПроцентВыплаты = ВыборкаДетальныеЗаписи.ПроцентВыплаты;
		
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура Группа2ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьРесурсы(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
		
		ПоказатьПредупреждение(,"Для расчета документ надо записать!",15,"Это новый документ!");
		
		Возврат;
		
	КонецЕсли;
	
	
	Если Объект.Проведен = Истина Тогда
	
		ПоказатьВопрос(
		Новый ОписаниеОповещения("РассчитатьРесурсыЗавершение", ЭтотОбъект)
		,"Рассчитывать можно только НЕПРОВЕДЕННЫЙ документ. Отменить проведение?",
		РежимДиалогаВопрос.ДаНет,
		30, КодВозвратаДиалога.Да,"Внимание! Документ проведен.", КодВозвратаДиалога.Да);
		
		Возврат;
	
	КонецЕсли;
	
	РассчитатьРесурсыНаСервере();
	
	ТекущийЭлемент = Элементы.СтраницаНачисления;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьРесурсыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт 

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
		
		РассчитатьРесурсыНаСервере();
		
		ТекущийЭлемент = Элементы.СтраницаНачисления;
	
	КонецЕсли;
	
	

КонецПроцедуры // РассчитатьРесурсыЗавершение()

&НаСервере
Процедура РассчитатьРесурсыНаСервере()
	
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокументОбъект.РассчитатьРесурсы(); //Вызов экспортной процедуры объекта
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	
КонецПроцедуры
